pmo-dataset/variations/graphviz_with_ids/18.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Provide missing\ndocuments"];
  "Task_2" [label="Meet with appeals\ncommittee"];
  "Task_3" [label="Send rejection\nletter"];
  "Task_4" [label="Set up IT accounts"];
  "Task_5" [label="Confirm enrollment"];
  "Task_6" [label="Add/drop courses"];
  "Task_7" [label="Review grades online"];
  "Task_8" [label="Graduate"];
  "Task_9" [label="Meet with academic\nadvisor"];
  "Task_10" [label="Post grades"];
  "Task_11" [label="Resolve schedule\nconflicts"];
  "Task_12" [label="Send acceptance\nletter"];
  "Task_13" [label="Send orientation\nmaterials"];
  "Task_14" [label="Withdraw"];
  "Task_15" [label="Cancel application"];
  "Task_16" [label="Evaluate application\nby admissions\ncommittee"];
  "Task_17" [label="Assist with visa\nprocessing"];
  "Task_18" [label="Review application\nand documents"];
  "Task_19" [label="Submit appeal form"];
  "Task_20" [label="Process fees or\nwaivers"];
  "Task_21" [label="Notify applicant of\nmissing documents"];
  "Task_22" [label="Await decision"];
  "Task_23" [label="Submit application\nonline"];
  "Task_24" [label="Select courses"];
  "Task_25" [label="Obtain student ID\ncard"];
  "Task_26" [label="Begin attending\nclasses"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="X"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ExclusiveGateway_13" [shape=diamond, label="X"];
  "ExclusiveGateway_14" [shape=diamond, label="X"];
  "ExclusiveGateway_15" [shape=diamond, label="X"];
  "ExclusiveGateway_16" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];

  "ExclusiveGateway_6" -> "EndNoneEvent_1";
  "Task_6" -> "ExclusiveGateway_15";
  "ParallelGateway_5" -> "ExclusiveGateway_3";
  "Task_12" -> "ExclusiveGateway_16";
  "Task_17" -> "ExclusiveGateway_13";
  "Task_22" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Task_13";
  "ExclusiveGateway_13" -> "ParallelGateway_6";
  "ExclusiveGateway_7" -> "ExclusiveGateway_15";
  "Task_26" -> "ExclusiveGateway_7";
  "StartNoneEvent_1" -> "Task_23";
  "Task_3" -> "ExclusiveGateway_6";
  "ParallelGateway_3" -> "ExclusiveGateway_9";
  "ExclusiveGateway_8" -> "Task_19";
  "ExclusiveGateway_16" -> "Task_15";
  "Task_24" -> "Task_11";
  "ExclusiveGateway_3" -> "Task_3";
  "Task_2" -> "Task_22";
  "ParallelGateway_1" -> "Task_4";
  "ExclusiveGateway_10" -> "Task_21";
  "ParallelGateway_2" -> "Task_16";
  "ExclusiveGateway_14" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Task_20";
  "Task_9" -> "Task_24";
  "Task_19" -> "Task_2";
  "Task_18" -> "ExclusiveGateway_10";
  "ExclusiveGateway_7" -> "Task_6";
  "Task_21" -> "Task_1";
  "Task_25" -> "ParallelGateway_3";
  "Task_15" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_6";
  "ExclusiveGateway_4" -> "Task_17";
  "Task_23" -> "Task_18";
  "ExclusiveGateway_1" -> "Task_14";
  "Task_10" -> "Task_7";
  "ExclusiveGateway_1" -> "Task_8";
  "Task_13" -> "ParallelGateway_4";
  "ParallelGateway_6" -> "Task_9";
  "ExclusiveGateway_5" -> "ExclusiveGateway_11";
  "Task_16" -> "ParallelGateway_5";
  "Task_7" -> "ExclusiveGateway_8";
  "ExclusiveGateway_11" -> "ExclusiveGateway_1";
  "ParallelGateway_4" -> "ExclusiveGateway_4";
  "Task_5" -> "ParallelGateway_1";
  "Task_4" -> "ParallelGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_13";
  "ExclusiveGateway_10" -> "ExclusiveGateway_14";
  "Task_20" -> "ParallelGateway_5";
  "ExclusiveGateway_3" -> "Task_12";
  "ParallelGateway_6" -> "Task_25";
  "Task_8" -> "ExclusiveGateway_12";
  "ExclusiveGateway_15" -> "Task_10";
  "Task_14" -> "ExclusiveGateway_12";
  "ExclusiveGateway_9" -> "Task_26";
  "ExclusiveGateway_12" -> "ExclusiveGateway_2";
  "ExclusiveGateway_11" -> "ExclusiveGateway_9";
  "Task_1" -> "ExclusiveGateway_14";
  "Task_11" -> "ParallelGateway_3";
  "ExclusiveGateway_8" -> "ExclusiveGateway_5";
  "ExclusiveGateway_16" -> "Task_5";
}
