pmo-dataset/variations/mermaid_basic/18.mmd
graph LR
	ExclusiveGateway_6{"X"} --> EndEvent_1(("end"))
	Task_6["Add/drop courses"] --> ExclusiveGateway_15{"X"}
	ParallelGateway_5{"+"} --> ExclusiveGateway_3{"X"}
	Task_12["Send acceptance letter"] --> ExclusiveGateway_16{"X"}
	Task_17["Assist with visa processing"] --> ExclusiveGateway_13{"X"}
	Task_22["Await decision"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_1{"+"} --> Task_13["Send orientation materials"]
	ExclusiveGateway_13 --> ParallelGateway_6{"+"}
	ExclusiveGateway_7{"X"} --> ExclusiveGateway_15
	Task_26["Begin attending classes"] --> ExclusiveGateway_7
	StartEvent_1(("start")) --> Task_23["Submit application online"]
	Task_3["Send rejection letter"] --> ExclusiveGateway_6
	ParallelGateway_3{"+"} --> ExclusiveGateway_9{"X"}
	ExclusiveGateway_8{"X"} --> Task_19["Submit appeal form"]
	ExclusiveGateway_16 --> Task_15["Cancel application"]
	Task_24["Select courses"] --> Task_11["Resolve schedule conflicts"]
	ExclusiveGateway_3 --> Task_3
	Task_2["Meet with appeals committee"] --> Task_22
	ParallelGateway_1 --> Task_4["Set up IT accounts"]
	ExclusiveGateway_10{"X"} --> Task_21["Notify applicant of missing documents"]
	ParallelGateway_2{"+"} --> Task_16["Evaluate application by admissions committee"]
	ExclusiveGateway_14{"X"} --> ParallelGateway_2
	ParallelGateway_2 --> Task_20["Process fees or waivers"]
	Task_9["Meet with academic advisor"] --> Task_24
	Task_19 --> Task_2
	Task_18["Review application and documents"] --> ExclusiveGateway_10
	ExclusiveGateway_7 --> Task_6
	Task_21 --> Task_1["Provide missing documents"]
	Task_25["Obtain student ID card"] --> ParallelGateway_3
	Task_15 --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> ExclusiveGateway_6
	ExclusiveGateway_4{"X"} --> Task_17
	Task_23 --> Task_18
	ExclusiveGateway_1{"X"} --> Task_14["Withdraw"]
	Task_10["Post grades"] --> Task_7["Review grades online"]
	ExclusiveGateway_1 --> Task_8["Graduate"]
	Task_13 --> ParallelGateway_4{"+"}
	ParallelGateway_6 --> Task_9
	ExclusiveGateway_5 --> ExclusiveGateway_11{"X"}
	Task_16 --> ParallelGateway_5
	Task_7 --> ExclusiveGateway_8
	ExclusiveGateway_11 --> ExclusiveGateway_1
	ParallelGateway_4 --> ExclusiveGateway_4
	Task_5["Confirm enrollment"] --> ParallelGateway_1
	Task_4 --> ParallelGateway_4
	ExclusiveGateway_4 --> ExclusiveGateway_13
	ExclusiveGateway_10 --> ExclusiveGateway_14
	Task_20 --> ParallelGateway_5
	ExclusiveGateway_3 --> Task_12
	ParallelGateway_6 --> Task_25
	Task_8 --> ExclusiveGateway_12{"X"}
	ExclusiveGateway_15 --> Task_10
	Task_14 --> ExclusiveGateway_12
	ExclusiveGateway_9 --> Task_26
	ExclusiveGateway_12 --> ExclusiveGateway_2
	ExclusiveGateway_11 --> ExclusiveGateway_9
	Task_1 --> ExclusiveGateway_14
	Task_11 --> ParallelGateway_3
	ExclusiveGateway_8 --> ExclusiveGateway_5
	ExclusiveGateway_16 --> Task_5
